In [164]:
import pandas as pd
from sqlalchemy import create_engine

# Define database connection parameters
db_url = "postgresql://soravit:wetprasit@localhost:5432/ninfinite"

# Create a SQLAlchemy engine
engine = create_engine(db_url)

product_query = "SELECT * FROM transaction;"
product_df = pd.read_sql(product_query, engine)

# sale = quantity * amount
product_df["sales"] = product_df["quantity"] * product_df["amount"]

# SQL Statement for create table user_transaction_amount

CREATE TABLE user_transaction_amount (  
user_id VARCHAR(255),  
total_order INTEGER,  
total_quantity INTEGER,  
total_sales INTEGER,  
average_sales FLOAT  
);

In [165]:
# ETL process for user_transaction_amount

# Aggregate with group by user_id to count order_id, sum quantity and total sales
user_transaction_amount_df = product_df.groupby('user_id').agg({
    'order_id': 'count', 
    'quantity': 'sum',
    'sales': 'sum'    
}).reset_index()

# Rename columns
user_transaction_amount_df.columns = ['user_id', 'total_order', 'total_quantity', 'total_sales']

# average_sales = total_sales / total_order
user_transaction_amount_df["average_sales"] = round(user_transaction_amount_df["total_sales"] / user_transaction_amount_df["total_order"],2)

# Save into table 'user_transaction_amount' in database
user_transaction_amount_df.to_sql('user_transaction_amount', engine, if_exists="replace", index=False)

# Query to fetch data from table user_transaction_amount
user_transaction_amount_query = "SELECT * FROM user_transaction_amount;"

# Run query to load result from ETL process in DataFrame and save to csv file
result1_df = pd.read_sql(user_transaction_amount_query, engine)
result1_df.to_csv('user_transaction_amount.csv', index=False)
result1_df

   user_id  total_order  total_quantity  total_sales  average_sales
0      480           35            1694       205252        5864.34
1      481           32            1611       225969        7061.53
2      482           38            1818       251208        6610.74
3      483           28            1393       197501        7053.61
4      484           33            1722       226834        6873.76
5      485           37            1920       235761        6371.92
6      486           52            2494       276734        5321.81
7      487           35            1900       259820        7423.43
8      488           27            1392       130132        4819.70
9      489           25            1402       183938        7357.52
10     490           35            1710       220108        6288.80
11     491           31            1605       219822        7091.03
12     492           25            1248       127689        5107.56
13     493           30            1452       235695        7856.50
14     494           38            1747       270376        7115.16
15     495           32            1748       228321        7135.03
16     496           33            1208       158133        4791.91
17     497           23            1039       158725        6901.09
18     498           35            1806       225168        6433.37
19     499           25            1354       172655        6906.20
20     500           27            1317       139769        5176.63
21     501           35            1841       268078        7659.37
22     502           29            1668       222295        7665.34
23     503           34            1815       225871        6643.26
24     504           22            1298       123602        5618.27
25     505           37            1786       241107        6516.41
26     506           34            1394       172775        5081.62
27     507           39            2118       265364        6804.21
28     508           33            1433       206798        6266.61
29     509           31            1612       205213        6619.77
30     510           26            1450       201005        7730.96
31     511           29            1923       264872        9133.52
32     512           31            1537       174735        5636.61
33     513           38            1677       196768        5178.11
34     514           38            1794       240639        6332.61
35     515           39            2272       304794        7815.23
36     516           35            1904       239647        6847.06
37     517           30            1461       208724        6957.47

# SQL Statement for create table daily_transaction_amount

CREATE TABLE daily_transaction_amount (  
order_date DATE,  
total_order INTEGER,  
min_sales INTEGER,  
max_sales INTEGER,  
total_sales INTEGER,  
average_sales FLOAT,  
VAT FLOAT  
);

In [166]:
# ETL process for daily_transaction_amount

# Aggregate with group by order_date to count order_id, min-max-sum total sales
daily_transaction_amount_df = product_df.groupby('order_date').agg({
    'order_id': 'count', 
    'sales': ['min', 'max', 'sum']  
}).reset_index()

# Rename columns
daily_transaction_amount_df.columns = ['order_date', 'total_order', 'min_sales', 'max_sales', 'total_sales']

# average_sales = total_sales / total_order
daily_transaction_amount_df["average_sales"] = round(daily_transaction_amount_df["total_sales"] / daily_transaction_amount_df["total_order"],2)

# VAT = total_sales * 0.07
daily_transaction_amount_df["VAT"] = round(daily_transaction_amount_df["total_sales"] * 0.07, 2)

# Save into table 'daily_transaction_amount' in database
daily_transaction_amount_df.to_sql('daily_transaction_amount', engine, if_exists="replace", index=False)

# Query to fetch data from table daily_transaction_amount
daily_transaction_amount_query = "SELECT * FROM daily_transaction_amount;"

# Run query to load result from ETL process in DataFrame and save to csv file
result2_df = pd.read_sql(daily_transaction_amount_query, engine)
result2_df.to_csv('daily_transaction_amount.csv', index=False)
result2_df

,order_date,total_order,min_sales,max_sales,total_sales,average_sales,VAT
0,2024-03-01,194,90,24010,1396055,7196.16,97723.85
1,2024-03-02,183,146,24153,1205297,6586.32,84370.79
2,2024-03-03,173,144,23958,1098550,6350.00,76898.50
3,2024-03-04,164,10,22320,1047746,6388.70,73342.22
4,2024-03-05,156,56,21922,898935,5762.40,62925.45
5,2024-03-06,188,54,24402,1220857,6493.92,85459.99
6,2024-03-07,178,44,23760,1244457,6991.33,87111.99

# SQL Statement for create table product_sales

CREATE TABLE product_sales (  
product_id VARCHAR(255),  
number_of_transaction INTEGER,  
total_sales INTEGER  
);

In [167]:
# ETL process for product_sales

# Aggregate with group by product_id to count order_id and sum total sales
product_sale_df = product_df.groupby('product_id').agg({
    'order_id': 'count',          
    'sales': 'sum'
}).reset_index()

# Rename columns
product_sale_df.columns = ['product_id', 'number_of_transaction', 'total_sales']

# Save into table 'product_sales' in database
product_sale_df.to_sql('product_sales', engine, if_exists="replace", index=False)

# Query to fetch data from table product_sales
product_sales_query = "SELECT * FROM product_sales;"

# Run query to load result from ETL process in DataFrame and save to csv file
result3_df = pd.read_sql(product_sales_query, engine)
result3_df.to_csv('product_sales.csv', index=False)
result3_df

   product_id  number_of_transaction  total_sales
0      100001                     13        59640
1      100002                     10        73885
2      100003                     15       105832
3      100004                     15       115399
4      100005                     15       100932
..        ...                    ...          ...
94     100095                     10        73707
95     100096                     11        43186
96     100097                     15       104570
97     100098                     15        82653
98     100099                      9        76805

[99 rows x 3 columns]

In [168]:
# Load data from table user_info 
user_query = "SELECT * FROM user_info;"
user_df = pd.read_sql(user_query, engine)

# Change user_id format to use in left join table between product_df and user_df
user_df["user_id"] = user_df["user_id"].astype(str)
product_user_join = pd.merge(product_df, user_df, on='user_id', how='left')

In [169]:
# Aggregate with group by location and gender to count order_id, min-max-sum of amount and sum total sales
location_gender_df = product_user_join.groupby(['location', 'gender']).agg({
    'order_id': 'count',
    'amount' : ['min', 'max', 'sum'],  
    'sales': 'sum'
}).reset_index()

# Rename columns
location_gender_df.columns = ['location', 'gender', 'total_order', 'min_amount', 'max_amount', 'sum_amount', 'total_sales']

# save to csv file
location_gender_df.to_csv('location_gender.csv', index=False)
location_gender_df

,location,gender,total_order,min_amount,max_amount,sum_amount,total_sales
0,Bangkok,F,27,10,230,3322,139769
1,Bangkok,M,61,12,246,7018,356003
2,Chiangmai,F,152,11,249,19787,1025576
3,Chiangmai,M,72,10,249,9397,443151
4,Chonburi,F,133,11,249,17209,906963
5,Chonburi,M,121,11,247,16510,719875
6,Khonkaen,F,57,12,246,7091,356010
7,Khonkaen,M,39,14,249,5244,304794
8,Nan,F,189,10,250,23859,1257629
9,Nan,M,162,12,249,20352,1083465
10,Phuket,F,98,17,247,13419,676669
11,Phuket,M,125,12,247,16660,841993

In [170]:
# Filter user with location in Chiangmai then aggregate with group by product_id and order_date
# Count order_id and sum total sales
product_order_date = product_user_join[product_user_join["location"] == 'Chiangmai'].groupby(['product_id', 'order_date']).agg({
    'order_id': 'count',  
    'sales': 'sum'
}).reset_index()

# Rename columns
product_order_date.columns = ['product_id', 'order_date', 'total_order', 'total_sales']

# Sort to display top20
top_20 = product_order_date.sort_values(by='total_sales', ascending=False).head(20)
top_20['Rank'] = range(1, 21)

# save to csv file
top_20.to_csv('top_20_best_sell_chiangmai.csv', index=False)
top_20

    product_id  order_date  total_order  total_sales  Rank
68      100035  2024-03-05            3        29247     1
138     100075  2024-03-02            2        27302     2
63      100034  2024-03-01            2        25702     3
15      100007  2024-03-07            2        25146     4
148     100080  2024-03-06            2        24962     5
30      100017  2024-03-07            2        24552     6
4       100003  2024-03-01            2        24080     7
107     100055  2024-03-06            2        23484     8
100     100051  2024-03-04            2        22644     9
145     100079  2024-03-06            1        21756    10
84      100044  2024-03-01            1        21364    11
73      100037  2024-03-03            1        21312    12
37      100021  2024-03-04            1        21070    13
62      100033  2024-03-05            2        20796    14
42      100023  2024-03-05            2        20332    15
123     100067  2024-03-06            1        19502    16
44      100024  2024-03-04            2        19352    17
156     100084  2024-03-05            2        18693    18
52      100028  2024-03-06            2        18500    19
132     100071  2024-03-02            2        18454    20